### 2.2 데이터 프레임(Data Frame)

In [1]:
import numpy as np
import pandas as pd

- 생성 방법 1
    - 2차원 데이터, 컬럼, 인덱스

In [2]:
df1 = pd.DataFrame(
    np.random.randint(40, 101, 12).reshape(4, 3),   # 2차원 데이터  
    columns=list('XYZ'),    # 컬럼명    # list('XYZ') = ['X', 'Y', 'Z']
    index=list('abcd')    # 인덱스명   # list('abcd') = ['a', 'b', 'c', 'd']
)
df1

    X   Y   Z
a  56  40  40
b  74  57  93
c  90  41  78
d  74  83  67

- 생성방법 2
    - 딕셔너리의 리스트

In [4]:
data = [
    {'X':67, 'Y':50, 'Z':45},
    {'X':72, 'Y':88, 'Z':79},
    {'X':71, 'Y':78, 'Z':57},
    {'X':82, 'Y':75, 'Z':98}
]
df2 = pd.DataFrame(data, index=list('abcd'))
df2

    X   Y   Z
a  67  50  45
b  72  88  79
c  71  78  57
d  82  75  98

- 생성방법 3
    - 데이터가 value, column명이 key가 되는 dictionary

In [5]:
data = {
    'X': [67, 72, 71, 82],
    'Y': [50, 88, 78, 75],
    'Z': [45, 79, 57, 98]
}
df3 = pd.DataFrame(data, index=list('abcd'))
df3

    X   Y   Z
a  67  50  45
b  72  88  79
c  71  78  57
d  82  75  98

- 여러가지 타입이 혼합된 형태의 데이터로 생성

In [6]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [7]:
df.index.name = '도시'
df

     지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [8]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [9]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [10]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

- 연습 문제 4.1.2

In [23]:
data = [
    [1, 2, 3, 4, 5],
    [10, 20, 30, 40, 50],
    [100, 200, 300, 400, 500],
    [1000, 2000, 3000, 4000, 5000],
    [10000, 20000, 30000, 40000, 50000]
]
df99 = pd.DataFrame(data, index=list('ABCDE'), columns=list('VWXYZ'))
df99, df99.transpose()

(       V      W      X      Y      Z
 A      1      2      3      4      5
 B     10     20     30     40     50
 C    100    200    300    400    500
 D   1000   2000   3000   4000   5000
 E  10000  20000  30000  40000  50000,
    A   B    C     D      E
 V  1  10  100  1000  10000
 W  2  20  200  2000  20000
 X  3  30  300  3000  30000
 Y  4  40  400  4000  40000
 Z  5  50  500  5000  50000)

In [24]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [25]:
# 열 이름이 있으면 갱신, 없으면 추가

- 열 삭제

In [26]:
del df['2000']

In [28]:
df.drop(columns=['2005', '2010'], inplace=True)
df

     지역     2015  2010-2015 증가율
도시
서울  수도권  9904312           2.83
부산  경상권  3448737           1.63
인천  수도권  2890451           9.82
대구  경상권  2466052           1.41

In [29]:
# 행을 지울 때
df.drop(['대구'], inplace=True)
df

     지역     2015  2010-2015 증가율
도시
서울  수도권  9904312           2.83
부산  경상권  3448737           1.63
인천  수도권  2890451           9.82

- 열 인덱싱

In [35]:
# 열 이름을 하나만 선택하면 시리즈 반환
df['지역'], df['2015']

(도시
 서울    수도권
 부산    경상권
 인천    수도권
 Name: 지역, dtype: object,
 도시
 서울    9904312
 부산    3448737
 인천    2890451
 Name: 2015, dtype: int64)

In [33]:
# 열 이름이 리스트로 감싸져 있으면 데이터프레임 반환
df[['지역', '2015']]

     지역     2015
도시
서울  수도권  9904312
부산  경상권  3448737
인천  수도권  2890451

- 개별 인덱싱

In [40]:
# 데이터프레임[열 이름][행 인덱스]
# 행보다 열이 먼저!!
df['지역']['서울'], df['지역'].서울, df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권', '수도권')

In [41]:
# 컬럼명이 숫자로 시작하거나 공백이 있는 경우에는 . 컬럼명을 사용할 수 없다.
df.2015['서울']

SyntaxError: invalid syntax (1569244376.py, line 2)

- 연습문제 4.1.3

In [81]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df100 = pd.DataFrame(data, index=index, columns=columns)

In [43]:
df100

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [65]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
q1 = pd.Series(data["수학"], index=index)
q1

춘향    90
몽룡    60
향단    80
방자    70
dtype: int64

In [73]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
q2 = df100[['국어', '영어']]
q2

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [75]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df100["평균"] = ((df100["국어"] + df100["영어"] + df100["수학"]) / 3).round(2)
df100

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [83]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df100.loc["방자", "영어"] = 80
df100["평균"] = ((df100["국어"] + df100["영어"] + df100["수학"]) / 3).round(2)
df100

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [92]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
q5 = df100[:1]
q5

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [101]:
# (6) 향단의 점수를 시리즈로 나타낸다.
q6 = pd.Series(df100[2:3], index=index)
q6

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().